kuafusoft/source_code/application/jqgrid/mcu/zzvw_device_ver/mcu_header_file/CWMCUS_V10_6_Kinetis_50MHz_KM1x_KM3x_FINAL_DROP_140717/_Test_Files/CMSIS_Test_MKM14Z5_v1_3.c
void test_MTBDWT(void) {
  (void)MTBDWT_BASE;
  (void)MTBDWT;
  MTBDWT_COMP0 = MTBDWT_COMP0 + 1;
  MTBDWT_MASK0 = MTBDWT_MASK0 + 1;
  MTBDWT_FCT0 = MTBDWT_FCT0 + 1;
  MTBDWT_COMP1 = MTBDWT_COMP1 + 1;
  MTBDWT_MASK1 = MTBDWT_MASK1 + 1;
  MTBDWT_FCT1 = MTBDWT_FCT1 + 1;
  MTBDWT_TBCTRL = MTBDWT_TBCTRL + 1;
  (void)MTBDWT_CTRL_DWTCFGCTRL_MASK;
  (void)MTBDWT_CTRL_DWTCFGCTRL_SHIFT;
  (void)MTBDWT_CTRL_DWTCFGCTRL(1);
  (void)MTBDWT_CTRL_NUMCMP_MASK;
  (void)MTBDWT_CTRL_NUMCMP_SHIFT;
  (void)MTBDWT_CTRL_NUMCMP(1);
  MTBDWT_COMP_REG(MTBDWT,0) = MTBDWT_COMP_REG(MTBDWT,0) + 1;
  MTBDWT_COMP(0) = MTBDWT_COMP(0) + 1;
  (void)MTBDWT_COMP_COMP_MASK;
  (void)MTBDWT_COMP_COMP_SHIFT;
  (void)MTBDWT_COMP_COMP(1);
  MTBDWT_COMP0 |= MTBDWT_COMP_COMP_MASK;
  MTBDWT_COMP0 &= ~(1U << MTBDWT_COMP_COMP_SHIFT);
  MTBDWT_MASK_REG(MTBDWT,0) = MTBDWT_MASK_REG(MTBDWT,0) + 1;
  MTBDWT_MASK(0) = MTBDWT_MASK(0) + 1;
  (void)MTBDWT_MASK_MASK_MASK;
  (void)MTBDWT_MASK_MASK_SHIFT;
  (void)MTBDWT_MASK_MASK(1);
  MTBDWT_MASK0 |= MTBDWT_MASK_MASK_MASK;
  MTBDWT_MASK0 &= ~(1U << MTBDWT_MASK_MASK_SHIFT);
  MTBDWT_FCT_REG(MTBDWT,0) = MTBDWT_FCT_REG(MTBDWT,0) + 1;
  MTBDWT_FCT(0) = MTBDWT_FCT(0) + 1;
  (void)MTBDWT_FCT_FUNCTION_MASK;
  (void)MTBDWT_FCT_FUNCTION_SHIFT;
  (void)MTBDWT_FCT_FUNCTION(1);
  MTBDWT_FCT0 |= MTBDWT_FCT_FUNCTION_MASK;
  MTBDWT_FCT0 &= ~(1U << MTBDWT_FCT_FUNCTION_SHIFT);
  (void)MTBDWT_FCT_DATAVMATCH_MASK;
  (void)MTBDWT_FCT_DATAVMATCH_SHIFT;
  MTBDWT_FCT0 |= MTBDWT_FCT_DATAVMATCH_MASK;
  MTBDWT_FCT0 &= ~(1U << MTBDWT_FCT_DATAVMATCH_SHIFT);
  (void)MTBDWT_FCT_DATAVSIZE_MASK;
  (void)MTBDWT_FCT_DATAVSIZE_SHIFT;
  (void)MTBDWT_FCT_DATAVSIZE(1);
  MTBDWT_FCT0 |= MTBDWT_FCT_DATAVSIZE_MASK;
  MTBDWT_FCT0 &= ~(1U << MTBDWT_FCT_DATAVSIZE_SHIFT);
  (void)MTBDWT_FCT_DATAVADDR0_MASK;
  (void)MTBDWT_FCT_DATAVADDR0_SHIFT;
  (void)MTBDWT_FCT_DATAVADDR0(1);
  MTBDWT_FCT0 |= MTBDWT_FCT_DATAVADDR0_MASK;
  MTBDWT_FCT0 &= ~(1U << MTBDWT_FCT_DATAVADDR0_SHIFT);
  (void)MTBDWT_FCT_MATCHED_MASK;
  (void)MTBDWT_FCT_MATCHED_SHIFT;
  MTBDWT_FCT0 |= MTBDWT_FCT_MATCHED_MASK;
  MTBDWT_FCT0 &= ~(1U << MTBDWT_FCT_MATCHED_SHIFT);
  MTBDWT_TBCTRL_REG(MTBDWT) = MTBDWT_TBCTRL_REG(MTBDWT) + 1;
  (void)MTBDWT_TBCTRL_ACOMP0_MASK;
  (void)MTBDWT_TBCTRL_ACOMP0_SHIFT;
  MTBDWT_TBCTRL |= MTBDWT_TBCTRL_ACOMP0_MASK;
  MTBDWT_TBCTRL &= ~(1U << MTBDWT_TBCTRL_ACOMP0_SHIFT);
  (void)MTBDWT_TBCTRL_ACOMP1_MASK;
  (void)MTBDWT_TBCTRL_ACOMP1_SHIFT;
  MTBDWT_TBCTRL |= MTBDWT_TBCTRL_ACOMP1_MASK;
  MTBDWT_TBCTRL &= ~(1U << MTBDWT_TBCTRL_ACOMP1_SHIFT);
  (void)MTBDWT_TBCTRL_NUMCOMP_MASK;
  (void)MTBDWT_TBCTRL_NUMCOMP_SHIFT;
  (void)MTBDWT_TBCTRL_NUMCOMP(1);
  MTBDWT_TBCTRL |= MTBDWT_TBCTRL_NUMCOMP_MASK;
  MTBDWT_TBCTRL &= ~(1U << MTBDWT_TBCTRL_NUMCOMP_SHIFT);
  (void)MTBDWT_DEVICECFG_DEVICECFG_MASK;
  (void)MTBDWT_DEVICECFG_DEVICECFG_SHIFT;
  (void)MTBDWT_DEVICECFG_DEVICECFG(1);
  (void)MTBDWT_DEVICETYPID_DEVICETYPID_MASK;
  (void)MTBDWT_DEVICETYPID_DEVICETYPID_SHIFT;
  (void)MTBDWT_DEVICETYPID_DEVICETYPID(1);
  (void)MTBDWT_PERIPHID_PERIPHID_MASK;
  (void)MTBDWT_PERIPHID_PERIPHID_SHIFT;
  (void)MTBDWT_PERIPHID_PERIPHID(1);
  (void)MTBDWT_COMPID_COMPID_MASK;
  (void)MTBDWT_COMPID_COMPID_SHIFT;
  (void)MTBDWT_COMPID_COMPID(1);
}

void test_NV(void) {
  (void)FTFA_FlashConfig_BASE;
  (void)FTFA_FlashConfig;
  (void)NV_BACKKEY3_KEY_MASK;
  (void)NV_BACKKEY3_KEY_SHIFT;
  (void)NV_BACKKEY3_KEY(1);
  (void)NV_BACKKEY2_KEY_MASK;
  (void)NV_BACKKEY2_KEY_SHIFT;
  (void)NV_BACKKEY2_KEY(1);
  (void)NV_BACKKEY1_KEY_MASK;
  (void)NV_BACKKEY1_KEY_SHIFT;
  (void)NV_BACKKEY1_KEY(1);
  (void)NV_BACKKEY0_KEY_MASK;
  (void)NV_BACKKEY0_KEY_SHIFT;
  (void)NV_BACKKEY0_KEY(1);
  (void)NV_BACKKEY7_KEY_MASK;
  (void)NV_BACKKEY7_KEY_SHIFT;
  (void)NV_BACKKEY7_KEY(1);
  (void)NV_BACKKEY6_KEY_MASK;
  (void)NV_BACKKEY6_KEY_SHIFT;
  (void)NV_BACKKEY6_KEY(1);
  (void)NV_BACKKEY5_KEY_MASK;
  (void)NV_BACKKEY5_KEY_SHIFT;
  (void)NV_BACKKEY5_KEY(1);
  (void)NV_BACKKEY4_KEY_MASK;
  (void)NV_BACKKEY4_KEY_SHIFT;
  (void)NV_BACKKEY4_KEY(1);
  (void)NV_FPROT3_PROT_MASK;
  (void)NV_FPROT3_PROT_SHIFT;
  (void)NV_FPROT3_PROT(1);
  (void)NV_FPROT2_PROT_MASK;
  (void)NV_FPROT2_PROT_SHIFT;
  (void)NV_FPROT2_PROT(1);
  (void)NV_FPROT1_PROT_MASK;
  (void)NV_FPROT1_PROT_SHIFT;
  (void)NV_FPROT1_PROT(1);
  (void)NV_FPROT0_PROT_MASK;
  (void)NV_FPROT0_PROT_SHIFT;
  (void)NV_FPROT0_PROT(1);
  (void)NV_FSEC_SEC_MASK;
  (void)NV_FSEC_SEC_SHIFT;
  (void)NV_FSEC_SEC(1);
  (void)NV_FSEC_FSLACC_MASK;
  (void)NV_FSEC_FSLACC_SHIFT;
  (void)NV_FSEC_FSLACC(1);
  (void)NV_FSEC_MEEN_MASK;
  (void)NV_FSEC_MEEN_SHIFT;
  (void)NV_FSEC_MEEN(1);
  (void)NV_FSEC_KEYEN_MASK;
  (void)NV_FSEC_KEYEN_SHIFT;
  (void)NV_FSEC_KEYEN(1);
  (void)NV_FOPT_LPBOOT_MASK;
  (void)NV_FOPT_LPBOOT_SHIFT;
  (void)NV_FOPT_NMI_EN_MASK;
  (void)NV_FOPT_NMI_EN_SHIFT;
  (void)NV_FOPT_EXE_MODE_MASK;
  (void)NV_FOPT_EXE_MODE_SHIFT;
  (void)NV_FOPT_CLK_SRC_MASK;
  (void)NV_FOPT_CLK_SRC_SHIFT;
}

void test_OSC(void) {
  (void)OSC_BASE;
  (void)OSC;
  OSC_CR = OSC_CR + 1;
  OSC_CR_REG(OSC) = OSC_CR_REG(OSC) + 1;
  (void)OSC_CR_SC16P_MASK;
  (void)OSC_CR_SC16P_SHIFT;
  OSC_CR |= OSC_CR_SC16P_MASK;
  OSC_CR &= ~(1U << OSC_CR_SC16P_SHIFT);
  (void)OSC_CR_SC8P_MASK;
  (void)OSC_CR_SC8P_SHIFT;
  OSC_CR |= OSC_CR_SC8P_MASK;
  OSC_CR &= ~(1U << OSC_CR_SC8P_SHIFT);
  (void)OSC_CR_SC4P_MASK;
  (void)OSC_CR_SC4P_SHIFT;
  OSC_CR |= OSC_CR_SC4P_MASK;
  OSC_CR &= ~(1U << OSC_CR_SC4P_SHIFT);
  (void)OSC_CR_SC2P_MASK;
  (void)OSC_CR_SC2P_SHIFT;
  OSC_CR |= OSC_CR_SC2P_MASK;
  OSC_CR &= ~(1U << OSC_CR_SC2P_SHIFT);
  (void)OSC_CR_EREFSTEN_MASK;
  (void)OSC_CR_EREFSTEN_SHIFT;
  OSC_CR |= OSC_CR_EREFSTEN_MASK;
  OSC_CR &= ~(1U << OSC_CR_EREFSTEN_SHIFT);
  (void)OSC_CR_ERCLKEN_MASK;
  (void)OSC_CR_ERCLKEN_SHIFT;
  OSC_CR |= OSC_CR_ERCLKEN_MASK;
  OSC_CR &= ~(1U << OSC_CR_ERCLKEN_SHIFT);
}

void test_PIT(void) {
  (void)PIT0_BASE;
  (void)PIT0;
  (void)PIT1_BASE;
  (void)PIT1;
  PIT0_MCR = PIT0_MCR + 1;
  PIT0_LDVAL0 = PIT0_LDVAL0 + 1;
  PIT0_TCTRL0 = PIT0_TCTRL0 + 1;
  PIT0_TFLG0 = PIT0_TFLG0 + 1;
  PIT0_LDVAL1 = PIT0_LDVAL1 + 1;
  PIT0_TCTRL1 = PIT0_TCTRL1 + 1;
  PIT0_TFLG1 = PIT0_TFLG1 + 1;
  PIT1_MCR = PIT1_MCR + 1;
  PIT1_LDVAL0 = PIT1_LDVAL0 + 1;
  PIT1_TCTRL0 = PIT1_TCTRL0 + 1;
  PIT1_TFLG0 = PIT1_TFLG0 + 1;
  PIT1_LDVAL1 = PIT1_LDVAL1 + 1;
  PIT1_TCTRL1 = PIT1_TCTRL1 + 1;
  PIT1_TFLG1 = PIT1_TFLG1 + 1;
  PIT_MCR_REG(PIT0) = PIT_MCR_REG(PIT0) + 1;
  PIT_MCR_REG(PIT1) = PIT_MCR_REG(PIT1) + 1;
  (void)PIT_MCR_FRZ_MASK;
  (void)PIT_MCR_FRZ_SHIFT;
  PIT0_MCR |= PIT_MCR_FRZ_MASK;
  PIT0_MCR &= ~(1U << PIT_MCR_FRZ_SHIFT);
  (void)PIT_MCR_MDIS_MASK;
  (void)PIT_MCR_MDIS_SHIFT;
  PIT0_MCR |= PIT_MCR_MDIS_MASK;
  PIT0_MCR &= ~(1U << PIT_MCR_MDIS_SHIFT);
  PIT_LDVAL_REG(PIT0,0) = PIT_LDVAL_REG(PIT0,0) + 1;
  PIT0_LDVAL(0) = PIT0_LDVAL(0) + 1;
  PIT1_LDVAL(0) = PIT1_LDVAL(0) + 1;
  PIT_LDVAL_REG(PIT1,0) = PIT_LDVAL_REG(PIT1,0) + 1;
  PIT0_LDVAL(0) = PIT0_LDVAL(0) + 1;
  PIT1_LDVAL(0) = PIT1_LDVAL(0) + 1;
  (void)PIT_LDVAL_TSV_MASK;
  (void)PIT_LDVAL_TSV_SHIFT;
  (void)PIT_LDVAL_TSV(1);
  PIT0_LDVAL0 |= PIT_LDVAL_TSV_MASK;
  PIT0_LDVAL0 &= ~(1U << PIT_LDVAL_TSV_SHIFT);
  (void)PIT_CVAL_TVL_MASK;
  (void)PIT_CVAL_TVL_SHIFT;
  (void)PIT_CVAL_TVL(1);
  PIT_TCTRL_REG(PIT0,0) = PIT_TCTRL_REG(PIT0,0) + 1;
  PIT0_TCTRL(0) = PIT0_TCTRL(0) + 1;
  PIT1_TCTRL(0) = PIT1_TCTRL(0) + 1;
  PIT_TCTRL_REG(PIT1,0) = PIT_TCTRL_REG(PIT1,0) + 1;
  PIT0_TCTRL(0) = PIT0_TCTRL(0) + 1;
  PIT1_TCTRL(0) = PIT1_TCTRL(0) + 1;
  (void)PIT_TCTRL_TEN_MASK;
  (void)PIT_TCTRL_TEN_SHIFT;
  PIT1_TCTRL0 |= PIT_TCTRL_TEN_MASK;
  PIT1_TCTRL0 &= ~(1U << PIT_TCTRL_TEN_SHIFT);
  (void)PIT_TCTRL_TIE_MASK;
  (void)PIT_TCTRL_TIE_SHIFT;
  PIT1_TCTRL0 |= PIT_TCTRL_TIE_MASK;
  PIT1_TCTRL0 &= ~(1U << PIT_TCTRL_TIE_SHIFT);
  (void)PIT_TCTRL_CHN_MASK;
  (void)PIT_TCTRL_CHN_SHIFT;
  PIT1_TCTRL0 |= PIT_TCTRL_CHN_MASK;
  PIT1_TCTRL0 &= ~(1U << PIT_TCTRL_CHN_SHIFT);
  PIT_TFLG_REG(PIT0,0) = PIT_TFLG_REG(PIT0,0) + 1;
  PIT0_TFLG(0) = PIT0_TFLG(0) + 1;
  PIT1_TFLG(0) = PIT1_TFLG(0) + 1;
  PIT_TFLG_REG(PIT1,0) = PIT_TFLG_REG(PIT1,0) + 1;
  PIT0_TFLG(0) = PIT0_TFLG(0) + 1;
  PIT1_TFLG(0) = PIT1_TFLG(0) + 1;
  (void)PIT_TFLG_TIF_MASK;
  (void)PIT_TFLG_TIF_SHIFT;
  PIT1_TFLG0 |= PIT_TFLG_TIF_MASK;
  PIT1_TFLG0 &= ~(1U << PIT_TFLG_TIF_SHIFT);
}

